# Series

<img src="series.jpg" style="width:300px;height:200px"/>

<img src="series_vs_list.jpg" style="width:300px;height:200px"/>

# DataFrame

<img src="dataframe.jpg" style="width:300px;height:200px"/>

In [2]:
import pandas as pd

In [3]:
series = pd.Series([1,2,3,4,5,6,7])

In [5]:
series

0    1
1    2
2    3
3    4
4    5
5    6
6    7
dtype: int64

In [6]:
index_day = ['Monday','Tuesday','Wednesday','Thursday','Friday','Saturday','Sunday']
data = [1,2,3,4,5,6,7]

In [7]:
series_day = pd.Series(data,index=index_day)
series_day

Monday       1
Tuesday      2
Wednesday    3
Thursday     4
Friday       5
Saturday     6
Sunday       7
dtype: int64

In [9]:
series_day[0]

1

In [10]:
series_day[6]

7

In [11]:
series_day['Sunday']

7

In [14]:
series_day['Sunday']=8
series_day

Monday       1
Tuesday      2
Wednesday    3
Thursday     4
Friday       5
Saturday     6
Sunday       8
dtype: int64

In [15]:
series_day.mean()

4.142857142857143

In [16]:
series_day*3

Monday        3
Tuesday       6
Wednesday     9
Thursday     12
Friday       15
Saturday     18
Sunday       24
dtype: int64

In [26]:
s = pd.Series(data,index=index_day)
s

Monday       1
Tuesday      2
Wednesday    3
Thursday     4
Friday       5
Saturday     6
Sunday       7
dtype: int64

In [27]:
df = pd.DataFrame({'first':s,'second':s*2})
df

           first  second
Monday         1       2
Tuesday        2       4
Wednesday      3       6
Thursday       4       8
Friday         5      10
Saturday       6      12
Sunday         7      14

# Make a DataFrame

In [28]:
column_names = ['City','Population']
index_country = ['Japan','India','China','Brazil','Mexico']

In [29]:
row1 = ['Tokyo',37.4]
row2 = ['New Delhi',28.5]
row3 = ['Shanghai',25.6]
row4 = ['Sao Paulo',21.7]
row5 = ['Mexico City',21.6]

In [31]:
data = [row1,row2,row3,row4,row5]
data

[['Tokyo', 37.4],
 ['New Delhi', 28.5],
 ['Shanghai', 25.6],
 ['Sao Paulo', 21.7],
 ['Mexico City', 21.6]]

In [32]:
df1 = pd.DataFrame(data,index=index_country,columns=column_names)
df1

               City  Population
Japan         Tokyo        37.4
India     New Delhi        28.5
China      Shanghai        25.6
Brazil    Sao Paulo        21.7
Mexico  Mexico City        21.6

In [33]:
cities = ['Tokyo','New Delhi','Shanghai','Sao Paulo','Mexico City']
population = [37.4,28.5,25.6,21.7,21.6]

In [34]:
data_dict = {'City':cities,'Population':population}
data_dict

{'City': ['Tokyo', 'New Delhi', 'Shanghai', 'Sao Paulo', 'Mexico City'],
 'Population': [37.4, 28.5, 25.6, 21.7, 21.6]}

In [35]:
df2 = pd.DataFrame(data_dict,index=index_country)
df2

               City  Population
Japan         Tokyo        37.4
India     New Delhi        28.5
China      Shanghai        25.6
Brazil    Sao Paulo        21.7
Mexico  Mexico City        21.6

In [36]:
df2['City']

Japan           Tokyo
India       New Delhi
China        Shanghai
Brazil      Sao Paulo
Mexico    Mexico City
Name: City, dtype: object

In [37]:
df2['Population']

Japan     37.4
India     28.5
China     25.6
Brazil    21.7
Mexico    21.6
Name: Population, dtype: float64

In [40]:
df2.describe()

       Population
count    5.000000
mean    26.960000
std      6.511759
min     21.600000
25%     21.700000
50%     25.600000
75%     28.500000
max     37.400000